Revit 2027 API
RebarConstraint.IsToCover Method
 Checks if the RebarConstraintType of the RebarConstraint is 'ToCover'. Returns true if the RebarConstraintType of the RebarConstraint is 'ToCover', false otherwise.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsToCover()
Public Function IsToCover As Boolean
public:
bool IsToCover()
member IsToCover : unit -> bool
Return Value
Boolean
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace